{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Google search - 2 🌶️🌶️\n",
    "На вход программе подается натуральное число n, затем n строк, затем число k — количество поисковых запросов, затем k строк — поисковые запросы. Напишите программу, которая выводит все введенные строки, в которых встречаются одновременно все поисковые запросы.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются натуральное число n — количество строк, затем сами строки в указанном количестве, затем число k, затем сами поисковые запросы.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести все введенные строки, в которых встречаются все поисковые запросы.\n",
    "\n",
    "Примечание. Поиск не должен быть чувствителен к регистру символов.\n",
    "\n",
    "Тестовые данные 🟢\n",
    "Sample Input:\n",
    "\n",
    "5\n",
    "Язык Python прекрасен\n",
    "C# - отличный язык программирования\n",
    "Stepik - отличная платформа\n",
    "BEEGEEK FOREVER!\n",
    "язык Python появился 20 февраля 1991\n",
    "2\n",
    "язык\n",
    "python\n",
    "Sample Output:\n",
    "\n",
    "Язык Python прекрасен\n",
    "язык Python появился 20 февраля 1991"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Язык Python прекрасен\n",
      "язык Python появился 20 февраля 1991\n"
     ]
    }
   ],
   "source": [
    "#n=int(input())\n",
    "#list1=[]\n",
    "#for i in range(n):\n",
    "#    x=str(input())\n",
    "#    list1.append(x)\n",
    "list1 = ['Язык Python прекрасен', 'C# - отличный язык программирования', 'Stepik - отличная платформа', 'BEEGEEK FOREVER!', 'язык Python появился 20 февраля 1991', 'ВСХ язык']\n",
    "#list1 = ['A caelo usque ad BEEGEEK centrum', 'A capillo usque ad ungues', 'A capite ad calcem beegeek', 'Ab absurdo beegeeK', 'Ab BEEGEEK equis ad asinos', 'Ab hoedis scindere oves']\n",
    "n=len(list1)\n",
    "    \n",
    "#k=int(input())\n",
    "#list2=[]\n",
    "#for j in range(k):\n",
    "#    y=str(input())\n",
    "#    list2.append(y)\n",
    "list2 = ['язык', 'python']\n",
    "#list2 = ['Beegeek']\n",
    "k=len(list2)\n",
    "\n",
    "# step 2\n",
    "list3=[]\n",
    "for i in range(len(list1)):\n",
    "    for j in range(len(list2)):\n",
    "        #print('list2[j].lower() = ', list2[j].lower())\n",
    "        #print('list1[i].lower() = ', list1[i].lower())\n",
    "        if list2[j].lower() not in list1[i].lower():\n",
    "            list3.append(i)\n",
    "#print('final list3', list3) #Но значения не уникальны\n",
    "\n",
    "# step 3 - save only unique numerals in list to delete\n",
    "#list3=[1, 2, 2, 3, 3, 5, 5, 5]\n",
    "list4=[]\n",
    "list4.append(list3[0])\n",
    "for i in range(1, len(list3)):\n",
    "    if list3[i-1]!=list3[i]:\n",
    "        list4.append(list3[i])\n",
    "#print('final list4 to delete =', list4)\n",
    "\n",
    "#step4 - удаляем лишние значения из списка\n",
    "list5=list1\n",
    "for i in range(len(list4), 0, -1):\n",
    "    #print(list4[i-1])\n",
    "    item = list5.pop(list4[i-1])\n",
    "\n",
    "#печатаю итог\n",
    "#print(list5)\n",
    "for i in range(len(list5)):\n",
    "    print(list5[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "n=int(input())\n",
    "list1=[]\n",
    "for i in range(n):\n",
    "    x=str(input())\n",
    "    list1.append(x)\n",
    "\n",
    "k=int(input())\n",
    "list2=[]\n",
    "for j in range(k):\n",
    "    y=str(input())\n",
    "    list2.append(y)\n",
    "\n",
    "list3=[]\n",
    "for i in range(len(list1)):\n",
    "    for j in range(len(list2)):\n",
    "        if list2[j].lower() not in list1[i].lower():\n",
    "            list3.append(i)\n",
    "\n",
    "list4=[]\n",
    "list4.append(list3[0])\n",
    "for i in range(1, len(list3)):\n",
    "    if list3[i-1]!=list3[i]:\n",
    "        list4.append(list3[i])\n",
    "\n",
    "list5=list1\n",
    "for i in range(len(list4), 0, -1):\n",
    "    item = list5.pop(list4[i-1])\n",
    "\n",
    "for i in range(len(list5)):\n",
    "    print(list5[i])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
